You do not have permission to edit the element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId HaveNoPermissionToEdit { get; }
  Visual Basic
Public Shared ReadOnly Property HaveNoPermissionToEdit As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ HaveNoPermissionToEdit {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace